# SetLockSlot Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
PanelScheduleView..::..SetLockSlot Method
PanelScheduleView Class See Also
---
Set lock state for a circuit slot at specific cell.
**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2023
# Syntax
C#
---
```text
public void SetLockSlot(
	int nRow,
	int nCol,
	bool bLock
)
```

Visual Basic
---
```text
Public Sub SetLockSlot ( _
	nRow As Integer, _
	nCol As Integer, _
	bLock As Boolean _
)
```

Visual C++
---
```text
public:
void SetLockSlot(
	int nRow,
	int nCol,
	bool bLock
)
```

# ### Parameters
nRow
    Type: System..::..Int32 Row Number
nCol
    Type: System..::..Int32 Column Number
bLock
    Type: System..::..Boolean Lock state to set
# See Also
PanelScheduleView Class
Autodesk.Revit.DB.Electrical Namespace